{
    "user_id": "0",
    "upgrade": {
        "sequence_id": "0",
        "command": "upgrade_history",
        "src_id": 2,
        "firmware_optional": {
            "firmware": {
                "version": "01.06.00.00",
                "url": "https://public-cdn.bblmw.com/upgrade/device/C11/01.06.00.00/product/c3697c95e9/ota-p003_v01.06.00.00-20240611152524.json.sig",
                "force_update": false,
                "description": "# Version OTA 01.06.00.00:\n## 【New features】\n1. Non-LAN binding via PIN code on the Studio side (in conjunction with Bambu Studio v01.09 and up).Users can bind P1 devices to the computer that is not on the same local area network (LAN) using a PIN code on the studio side\n2. Improved manual flow calibration parameters management.\n- Auto-save the manual flow calibration parameters\n- Support creating & managing new PA parameters\n-  Support setting PA configuration files on the filament settings page in Studio\n3. Third-party filament support. Users can create and manage custom filament profiles in Studio. These custom filaments can then be selected in Studio Device filament slots, and then be synced to the printer and Handy.\n4. Added carbon rods & lead screws maintenance notice\n5. Added heatbed abnormal protection\n6. Improved color display for gradient and dual-color filaments\n7. Added filament verification for \"Reducing purging through retracting filament\" function.\n  A long retraction during filament change can significantly reduce the purge volume, but it may cause clogging when the filaments assigned in the sliced file do not completely match the actual filaments in use. The filament verification function will verify the filaments match before performing retraction.\n  This function needs to be used with the slice files generated by Bambu Studio v01.09 and above. For more information about the \"Reducing purging through retracting filament\" function, please refer to the Bambu studio release notes[https://github.com/bambulab/BambuStudio/releases].\n8. Added option to opt in/out of User Experience Improvement Program in Settings > Devices\n## 【Feature Optimizations】\n1. Added secondary confirmation when stopping a print, as a safety to protect the user from accidentally canceling a print. \n2. Optimized Total Print Time Calculation, add abnormal pausing time into the stat.\n3. Auto filament type verification when printing with 3MF files from an SD card\n4. Enhancing Custom Device Naming Functionality. Support retaining custom device names after logout and synchronizing them across devices.\n## 【Bug fixes】\n1. Fixed the button no response glitch when formatting the SD card\n2. Fixed intermittent black screen after power-loss recovery\n3. Optimized FW update printer status check for safer update\n4. Optimized status verification when downloading a language package to avoid process conflict\n5. Fixed the issue of devices being unable to send print jobs after not restarting for an extended period.\n6. Prevent conflicts with Bambu Cloud service & potential damage to printer hardware by prohibiting crucial printer controls (initiating printing, heating the nozzle, and heating the heatbed) through the local MQTT Broker while the printer is logged into Bambu Cloud service.\n\nBefore this firmware update, the printer's local MQTT Broker can process control commands under cloud mode. This meant that two asynchronous channels were controlling the printer simultaneously. The commands from these two channels would execute in an overlapping manner without any order assurance, which is considered conflicting.\nTo ensure the stable operation of the printer and avoid malfunctions caused by control channel conflicts, we will disable certain printer control functions via the local MQTT Broker under cloud mode. These functions have higher security requirements, and we want only one channel to be able to use these functions at any given time. The restricted controls include:\n1. Initiating print\n2. Heating the nozzle\n3. Heating the heatbed\nPlease note that this restriction will affect the use of software and hardware such as Home Assistant and BiQu Panda Touch. Suppose you still need to use such software and hardware to control the restricted functions. In that case, we recommend enabling the printer's LAN Only mode to continue using the restricted control functions with the Local MQTT Broker.\nWe will detail these restrictions in the firmware update notes to ensure users are informed in advance.",
                "status": "release"
            },
            "ams": [
                {
                    "dev_model_name": "BL-A001",
                    "address": 0,
                    "device_id": "",
                    "firmware": [
                        {
                            "version": "00.00.06.40",
                            "force_update": false,
                            "url": "https://public-cdn.bambulab.com/upgrade/device/BL-A001/00.00.06.40/product/ams-ota_v00.00.06.40-20230906131441.json.sig",
                            "description": "",
                            "status": "testing"
                        }
                    ],
                    "firmware_current": null
                }
            ]
        }
    }
}
