{
    "user_id": "0",
    "upgrade": {
        "sequence_id": "0",
        "command": "upgrade_history",
        "src_id": 2,
        "firmware_optional": {
            "firmware": {
                "version": "01.08.00.00",
                "url": "https://public-cdn.bblmw.com/upgrade/device/BL-P002/01.08.00.00/product/45ea644d25/ota-v01.08.00.00-20240506131039.json.sig",
                "force_update": false,
                "description": "# Version ota 01.08.00.00:\n## [Feature Optimization]\n1. Added filament verification for \"Reducing purging through retracting filament\" function\n  A long retraction during filament change can significantly reduce the purge volume, but it may cause clogging when the filaments assigned in the sliced file do not completely match the actual filaments in use. The filament verification function will verify the filaments match before performing retraction.\n  This function needs to be used with the slice files generated by Bambu studio v01.09.00.67 and above. For more information about the \"Reducing purging through retracting filament\" function, please refer to the Bambu studio release notes[https://github.com/bambulab/BambuStudio/releases/tag/v01.09.00.69].\n2. Added support for using third-party custom filaments on the Bambu Handy side\n  Add third-party custom filaments to the Bambu Studio filaments library. You can set the existing filament type on the Bambu Handy side to the third-party custom filaments added in Bambu Studio.\n3. Optimized the AMS hygrometer Icon.\n4. Support the display of newly released translucent filaments in Mosaic style corresponding to the colors\n5. Improved firmware update issues\n6. Added support for network connections under the 802.11w protocol\n7. Optimized wifi connection stability\n8. Optimized the filament auto-mapping logic when printing with AMS. The color slot that cannot be mapped would need to be manually assigned filament before printing\n9. Optimized ntp time synchronization\n\n## [Bug fix]\n1. Fixed the live-view lagging issue caused by a WiFi driver bug\n2. Fixed intermittent connection failure when switching from encrypted to non-encrypted connection\n3. Fixed the video resolution switch glitch problem: when switching resolutions, the resolution switch displays glitching intermittently between different resolutions\n4. Fixed the problem that the light on the toolhead is not correctly turned off after the print completion. In conjunction with Bambu Studio v01.09.00.70 and above\n5. Fixed the abrupt fan speed transition problem when the chamber cooling fan automatically adjusts the speed according to the starting Gcode of certain filaments\n6. Fixed the false alarms of extrusion failure caused by reducing purge through retracting filament function\n7. Fixed screen memory leak issue\n8. Fixed the problem of automatic temperature control failure after power-loss recovery\n9. Fixed the false report of abnormal temperature control when the heating bed is set to 120 °C.\n## [Pending issues]\n- After upgrading to the latest version (v1.8.0.0), Bambu Studio may falsely report that there is a new version available. Clicking on the upgrade button at this point will result in a failed upgrade.(The prompt for the new version of the device is based on the printer screen and Bambu Handy)",
                "status": "release"
            },
            "ams": [
                {
                    "dev_model_name": "BL-A001",
                    "address": 0,
                    "device_id": "",
                    "firmware": [
                        {
                            "version": "00.00.06.40",
                            "force_update": false,
                            "url": "https://public-cdn.bambulab.com/upgrade/device/BL-A001/00.00.06.40/product/ams-ota_v00.00.06.40-20230906131441.json.sig",
                            "description": "",
                            "status": "testing"
                        }
                    ],
                    "firmware_current": null
                }
            ]
        }
    }
}
